Revit 2027 API
FamilyUtils.FamilyCanConvertToFaceHostBased Method
 Indicates whether the family can be converted to face host based.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool FamilyCanConvertToFaceHostBased(
	Document document,
	ElementId familyId
)
Public Shared Function FamilyCanConvertToFaceHostBased (
	document As Document,
	familyId As ElementId
) As Boolean
public:
static bool FamilyCanConvertToFaceHostBased(
	Document^ document,
	ElementId^ familyId
)
static member FamilyCanConvertToFaceHostBased :
        document : Document *
        familyId : ElementId -> bool
Parameters
document Document
 The document.
familyId ElementId
 The element id of the family.
Return Value
Boolean
 True if the family can be converted to face-based. Otherwise false, which will be returned if there any family instances exist in the project, the family is already face-based, or the family does not have a host. Also, false is returned if the family does not belong to one of the following categories:
OST_CommunicationDevices
OST_DataDevices
OST_DuctTerminal
OST_ElectricalEquipment
OST_ElectricalFixtures
OST_FireAlarmDevices
OST_LightingDevices
OST_LightingFixtures
OST_MechanicalControlDevices
OST_MechanicalEquipment
OST_NurseCallDevices
OST_PlumbingEquipment
OST_PlumbingFixtures
OST_SecurityDevices
OST_Sprinklers
OST_TelephoneDevices
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilyUtils Class
Autodesk.Revit.DB Namespace